Revit 2027 API
TextNode.VerticalAlignment Property
 Indicates default vertical alignment of the text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VerticalTextAlignment VerticalAlignment { get; }
Public ReadOnly Property VerticalAlignment As VerticalTextAlignment
	Get
public:
property VerticalTextAlignment VerticalAlignment {
	VerticalTextAlignment get ();
}
member VerticalAlignment : VerticalTextAlignment with get
Property Value
VerticalTextAlignment
See Also
Reference
TextNode Class
Autodesk.Revit.DB Namespace